blog/2021/05/git-tracking-review-branches/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-25 Wed 15:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tracking Review Branches with Git</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="Automatically pulling pull-request branches"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.devnulllabs.io"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://twitter.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-twitter fa-1x"></i>
  </a>
  <a href="https://www.buymeacoffee.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-mug-hot fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/932F3E8E1C0F4A9895D7B8B8B0CAA28A02958308.txt"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">Tracking Review Branches with Git</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge0cd00c">GitHub</a></li>
<li><a href="#org4ee2018">GitLab</a></li>
<li><a href="#orga9b637d">Local Branch Prefix</a></li>
<li><a href="#org048e5f9">Branch Discovery</a></li>
<li><a href="#org2bef167">Manual Checkout</a></li>
<li><a href="#org9b14b2e">Repositories with Many Pull Requests</a></li>
<li><a href="#org417168b">tl;dr:</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
When reviewing code, it's often necessary to pull the changes under review.
There are ad-hoc ways of doing this.  But there are also more automatic ways as
well.  In this post, we discuss the more automatic approaches for <a href="https://github.com">GitHub</a> and
<a href="https://gitlab.com">GitLab</a>.  Other forges may have the ability to use this trick, we discuss how to
discover the remote references, if they are available.
</p>

</div>

<blockquote>
<p>
Terminology: I am going to use "pull request" to refer to <a href="https://github.com">GitHub's</a> "pull
requests" and <a href="https://gitlab.com">GitLab's</a> "merge requests."  The difference in naming is purely
cosmetic, both represent the same concept, and both borrow that concept from
kernel development etiquette, what <a href="https://git-scm.com/">https://git-scm.com/</a> was originally developed for.
</p>
</blockquote>

<div id="outline-container-orge0cd00c" class="outline-2">
<h2 id="orge0cd00c"><a id="ID-9b9ad4e4-653e-4e80-8868-dd144f291b12"></a>GitHub</h2>
<div class="outline-text-2" id="text-orge0cd00c">
<p>
If we are working with a <a href="https://github.com">GitHub</a> repository, we can run the following command,
assuming <code>origin</code> is the remote where pull requests are submitted:
</p>

<div class="org-src-container">
<pre class="src src-bash">git config --add remote.origin.fetch <span style="font-style: italic;">"+refs/pull/*/head:refs/remotes/origin/pull/*"</span>
</pre>
</div>

<p>
This command adds a line to the <code>remote.origin</code> configuration section of the
current repository.  The <code>fetch</code> value provides a remote to local naming pattern
to be used when fetching changes from the remote.
</p>

<p>
The full <code>remote.origin</code> section should look similar to the following:
</p>

<div class="org-src-container">
<pre class="src src-config">[remote "origin"]
	fetch = +refs/heads/*:refs/remotes/origin/*
	url = git@github.com:owner/repo.git
	fetch = +refs/pull/*/head:refs/remotes/origin/pull/*
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ee2018" class="outline-2">
<h2 id="org4ee2018"><a id="ID-d73325c5-552c-481f-b744-9547318eaf24"></a>GitLab</h2>
<div class="outline-text-2" id="text-org4ee2018">
<p>
Similarly, if we are working with <a href="https://gitlab.com">GitLab</a> repositories, we can use a similar
command to accomplish the same result, again assuming <code>origin</code> as the remote:
</p>

<div class="org-src-container">
<pre class="src src-bash">git config --add remote.origin.fetch <span style="font-style: italic;">"+refs/merge-requests/*/head:refs/remotes/origin/merge-requests/*"</span>
</pre>
</div>

<p>
Likewise, the full <code>remote.origin</code> configuration should be similar to the
following:
</p>

<div class="org-src-container">
<pre class="src src-config">[remote "origin"]
  url = https://gitlab.com/owner/repo.git
  fetch = +refs/heads/*:refs/remotes/origin/*
  fetch = +refs/merge-requests/*/head:refs/remotes/origin/merge-requests/*
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9b637d" class="outline-2">
<h2 id="orga9b637d"><a id="ID-ac0df415-b1f5-4352-8abc-45f7f13b76e9"></a>Local Branch Prefix</h2>
<div class="outline-text-2" id="text-orga9b637d">
<p>
The local branch prefix can be set to any value that is desired.  Don't like
<code>origin/pull/${pr}</code>?  Change it.  A <a href="https://gist.github.com/piscisaureus/3342247">common option</a> is to use <code>origin/pr</code> instead.
Similarly, don't like <code>origin/merge-requests/${pr}</code>?  Feel free to change the
reference prefix.  Simply modify the commands above to use the appropriate
prefix for each remote:
</p>

<div class="org-src-container">
<pre class="src src-bash">git config --add remote.origin.fetch <span style="font-style: italic;">"+refs/pull/*/head:refs/remotes/origin/pr/*"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">git config --add remote.origin.fetch <span style="font-style: italic;">"+refs/merge-requests/*/head:refs/remotes/origin/pr/*"</span>
</pre>
</div>

<p>
When choosing a prefix, it's important not to choose a prefix for pull requests
that are often also used for branches on the remote.  For example, if
developers often push branches to the project such as <code>pr/1337</code>, <a href="https://git-scm.com/">https://git-scm.com/</a> warns that
these references are ambiguous.
</p>
</div>
</div>

<div id="outline-container-org048e5f9" class="outline-2">
<h2 id="org048e5f9"><a id="ID-09327560-6051-475c-9fd0-c7fe0bae9733"></a>Branch Discovery</h2>
<div class="outline-text-2" id="text-org048e5f9">
<p>
When using a different forge than <a href="https://github.com">GitHub</a> or <a href="https://gitlab.com">GitLab</a>, it may be possible to
discover the appropriate pattern for references to pull requests.
Documentation for checking out pull request references may not be available,
unlike  <a href="https://docs.github.com/en/github/collaborating-with-issues-and-pull-requests/checking-out-pull-requests-locally">GitHub</a> and <a href="https://docs.gitlab.com/ee/user/project/merge_requests/reviews/">GitLab</a>.  Therefore, we need to look to <a href="https://git-scm.com/">git</a> itself,
specifically, <a href="https://www.git-scm.com/docs/git-ls-remote">git-ls-remote</a>.
</p>

<p>
Using <a href="https://www.git-scm.com/docs/git-ls-remote">git-ls-remote</a>, we can list <b>all</b> remote references hosted by the
repository.  <a href="https://www.git-scm.com/docs/git-branch">git-branch</a>, by comparison, only lists references which are being
"tracked," i.e., fetched by the fetch rules for the remote repository.
</p>

<div class="org-src-container">
<pre class="src src-bash">git ls-remote
</pre>
</div>

<p>
From the list of references, it should be evident which references refer to
pull requests.  Unfortunately, there is no immediate way to select between open
and closed pull requests.  For <a href="https://github.com">GitHub</a>, this means <a href="https://www.git-scm.com/docs/git-ls-remote"><code>git ls-remote</code></a> returns <span class="underline">every</span>
pull requests for the repository.
</p>

<p>
The following is an example listing from <a href="https://github.com/nix-community/emacs-overlay">nix-community/emacs-overlay</a>:
</p>

<pre class="example">
c30763fa3d800911ee57c4cdaf558b416e4c5780	HEAD
5b9f3a8258c4b42c9c3dfcb77bde5d2e3abbc6eb	refs/heads/elpa
6cce77a7865731bd64f12b0ade938c0082f869c6	refs/heads/expect
47a2e0b85642a229aa45c03c4c590ad0e4294788	refs/heads/gccemacs
c30763fa3d800911ee57c4cdaf558b416e4c5780	refs/heads/master
80b60da21dbf15a683a3fcc0138a96478794bef0	refs/heads/melpa
b74dbf73ecf7cc420740c87af4c2d113d1fdd58e	refs/heads/nativecomp-pkgs
f911b18763ad50bf49a5928b95fb149ba638b2e2	refs/heads/updater-python
3d7612182992cc57148c545c11cb9415bb7d23f0	refs/pull/103/head
2ecd882d2b6e2f4f710c08419a5899d8215f7cc9	refs/pull/103/merge
7689a4093e2986e72a2b3e981b4ae86124c1dfb6	refs/pull/105/head
d7bdc8d3be125e90c8f01650e17b66b814609ec3	refs/pull/111/head
9e8e8cae4dba0fe46569f010119b4ca269a3a9c0	refs/pull/118/head
401546016dc12b1416f5a3f85e26e1b8294ee5c4	refs/pull/119/head
997966c8d635dcada8c8bd3aa40a643745dd5ca8	refs/pull/12/head
f911b18763ad50bf49a5928b95fb149ba638b2e2	refs/pull/121/head
5a99e863b84825a13a125b145170b8d6aeef9200	refs/pull/121/merge
</pre>

<p>
From the above list, we can see the pull requests are under the <code>refs/pull</code>
path.
</p>
</div>
</div>

<div id="outline-container-org2bef167" class="outline-2">
<h2 id="org2bef167"><a id="ID-59daddd1-4dc0-45b2-a94a-ae8b1291982d"></a>Manual Checkout</h2>
<div class="outline-text-2" id="text-org2bef167">
<p>
Without downloading and keeping track of <i>all</i> pull request branches, individual
pull requests can be checked out as well.  However, doing so requires an extra
command.
</p>

<div class="org-src-container">
<pre class="src src-bash">git fetch origin pull/${<span style="font-weight: bold; font-style: italic;">pr</span>}/head
git checkout -b pr/${<span style="font-weight: bold; font-style: italic;">pr</span>} FETCH_HEAD
</pre>
</div>

<p>
<a href="https://github.com">GitHub</a> automatically creates a merge reference between the pull request and the
merge target branch.  This is done to check whether a pull request can be
merged cleanly or if merge conflicts exist.  Following similar steps, we can
checkout <a href="https://github.com">GitHub's</a> automatically merged pull request reference:
</p>

<div class="org-src-container">
<pre class="src src-bash">git fetch origin pull/${<span style="font-weight: bold; font-style: italic;">pr</span>}/merge
git checkout -b pr/${<span style="font-weight: bold; font-style: italic;">pr</span>}/merge FETCH_HEAD
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b14b2e" class="outline-2">
<h2 id="org9b14b2e"><a id="ID-d4d68742-79b6-4e79-97ad-0a90295e8cca"></a>Repositories with Many Pull Requests</h2>
<div class="outline-text-2" id="text-org9b14b2e">
<p>
While adding the extra fetch and branch prefix is a nice way to automatically
track pull requests against a repository, the repository may have more pull
requests than we wish to regularly fetch and update.  Consider <a href="https://github.com/NixOS/nixpkgs">NixOS/nixpkgs</a>.
As of this writing, the number of open pull requests is 2,540.  Furthermore,
there has been 101,345 pull requests submitted to date.  49 pull requests were
opened today alone.  Running <code>git remote update</code> or <code>git fetch upstream</code> with the
added fetch for pull requests might be to demanding for a regular workflow.
</p>

<p>
Instead of always downloading pull request references, instead, we can fetch
the pull requests from a different "remote."
</p>

<p>
For example, the following is the relevant sections of my <code>.git/config</code> for
<a href="https://github.com/NixOS/nixpkgs">NixOS/nixpkgs</a>:
</p>

<div class="org-src-container">
<pre class="src src-config">[remote "origin"]
	url = ssh://github.com/kennyballou/nixpkgs.git
	fetch = +refs/heads/*:refs/remotes/origin/*
[remote "upstream"]
	url = git://github.com/nixos/nixpkgs.git
	fetch = +refs/heads/*:refs/remotes/upstream/*
[remote "review"]
	url = git://github.com/nixos/nixpkgs.git
	fetch = +refs/pull/*/head:refs/remotes/review/*
</pre>
</div>

<p>
This way, <code>git fetch upstream</code> only fetches upstream branch changes; no pull
request references are fetched.  Conversely, <code>git fetch review</code> fetches
references for all pull requests.  This enables rebase workflows to still be
relatively fast, while review workflows can still be accomplished using the
same fetch trick as above.
</p>
</div>
</div>

<div id="outline-container-org417168b" class="outline-2">
<h2 id="org417168b"><a id="ID-53f2c709-78ed-40d4-b9d7-651dfa4ec462"></a>tl;dr:</h2>
<div class="outline-text-2" id="text-org417168b">
<p>
To automatically fetch pull requests from <a href="https://github.com">GitHub</a> repositories, run the
following command, assuming <code>upstream</code> is the remote where pull requests are
submitted:
</p>

<div class="org-src-container">
<pre class="src src-bash">git config --add remote.upstream.fetch <span style="font-style: italic;">"+refs/pull/*/head:refs/remotes/upstream/pr/*"</span>
</pre>
</div>

<p>
Or, for <a href="https://gitlab.com">GitLab</a> repositories, under the same assumption:
</p>

<div class="org-src-container">
<pre class="src src-bash">git config --add remote.upstream.fetch <span style="font-style: italic;">"+refs/merge-requests/*/head:refs/remotes/upstream/pr/*"</span>
</pre>
</div>

<p>
To manually checkout a pull request branch, use the following:
</p>

<div class="org-src-container">
<pre class="src src-bash">git fetch upstream pull/${<span style="font-weight: bold; font-style: italic;">pr</span>}/head
git checkout -b pr/${<span style="font-weight: bold; font-style: italic;">pr</span>} FETCH_HEAD
</pre>
</div>

<p>
Finally, if the repository contains a large number of pull requests, it may be
preferred to use a different "remote" for tracking pull request references:
</p>

<div class="org-src-container">
<pre class="src src-bash">git remote add review $(git config remote.upstream.url)
git remote review.upstream.fetch <span style="font-style: italic;">"+refs/pull/*/head:refs/remotes/review/*"</span>
</pre>
</div>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2022 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
